### Perform data manipulation using pandas

In [1]:
# import library
import pandas as pd

In [2]:
# find the version of pandas
pd.__version__

'2.2.3'

In [3]:
# create dataframe

df= pd.DataFrame({
    "name" : ["Tooba" , "Yusra" , "Esha" , "Aisha"] ,
    "age" : [20 , 18 , 21 , 12]
})

In [4]:
df

    name  age
0  Tooba   20
1  Yusra   18
2   Esha   21
3  Aisha   12

In [23]:
df.shape

(4, 2)

In [24]:
df.describe()

             AGE
count   4.000000
mean   17.750000
std     4.031129
min    12.000000
25%    16.500000
50%    19.000000
75%    20.250000
max    21.000000

In [25]:
df.T

          0      1     2      3
NAME  Tooba  Yusra  Esha  Aisha
AGE    20.0   18.0  21.0   12.0

In [26]:
df.columns

Index(['NAME', 'AGE'], dtype='object')

In [27]:
df.dtypes

NAME     object
AGE     float64
dtype: object

In [5]:
# Rename the column name

df.rename(columns={"name" : "NAME" , "age" : "AGE"}, inplace=True)

In [6]:
# Add prefix of  column name 

df.add_prefix("Stu_")

  Stu_NAME  Stu_AGE
0    Tooba       20
1    Yusra       18
2     Esha       21
3    Aisha       12

In [7]:
# reverse the row order
df.loc[::-1]

    NAME  AGE
3  Aisha   12
2   Esha   21
1  Yusra   18
0  Tooba   20

In [8]:
df.loc[::-1].reset_index(drop=True)

    NAME  AGE
0  Aisha   12
1   Esha   21
2  Yusra   18
3  Tooba   20

In [9]:
# reverse column order
df.loc[: , ::-1].reset_index(drop=True)

   AGE   NAME
0   20  Tooba
1   18  Yusra
2   21   Esha
3   12  Aisha

In [10]:
# Select column by data type
df.select_dtypes(include=["int"])

   AGE
0   20
1   18
2   21
3   12

In [11]:
df.select_dtypes(exclude=["int"])

    NAME
0  Tooba
1  Yusra
2   Esha
3  Aisha

In [12]:
# Type casting

df["AGE"]= df["AGE"].astype(float)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    4 non-null      object
 1   AGE     4 non-null      float64
dtypes: float64(1), object(1)
memory usage: 192.0+ bytes

In [14]:
# Spiting of data 
df_1 = df.sample(frac=0.5 , random_state=1)
df_1

    NAME   AGE
3  Aisha  12.0
2   Esha  21.0

In [15]:
df_2 = df.drop(df_1.index)
df_2

    NAME   AGE
0  Tooba  20.0
1  Yusra  18.0

In [16]:
# Concatenate
com = pd.concat([df_2 , df_1])

In [17]:
com

    NAME   AGE
0  Tooba  20.0
1  Yusra  18.0
3  Aisha  12.0
2   Esha  21.0

In [18]:
# Filteration of data
df.AGE.unique()

array([20., 18., 21., 12.])

In [19]:
df.NAME.unique()

array(['Tooba', 'Yusra', 'Esha', 'Aisha'], dtype=object)

In [20]:
df[(df["AGE"] <= 20) & (df["NAME"] == "Tooba") | (df["NAME"] == "Aisha")]

    NAME   AGE
0  Tooba  20.0
3  Aisha  12.0

In [21]:
df.groupby(["AGE"]).count()

      NAME
AGE
12.0     1
18.0     1
20.0     1
21.0     1

In [22]:
df.groupby(["AGE" , "NAME"]).size()

AGE   NAME
12.0  Aisha    1
18.0  Yusra    1
20.0  Tooba    1
21.0  Esha     1
dtype: int64